       identification division.
       program-id. JBTE0002.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           DISPLAY "JBtest02 Version 1.0"
           DISPLAY "remote wip2 mod aaaaa"
           goback.

       end program JBTE0002.
