       identification division.
       program-id. JBTE0004.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           DISPLAY "JBtest04 Version 1.0"
           DISPLAY "Remote WIP2 copy"
           goback.

       end program JBTE0004.
