       identification division.
       program-id. JBTE0001.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           DISPLAY "JBTE0001 Version 1.0"
           DISPLAY "Remote:This is on the main branch"
           goback
           .

       end program JBTE0001.
