       identification division.
       program-id. JBTE0003.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.
           DISPLAY "JBtest03 Version 1.0"
           DISPLAY "Another one on branch 02"
           goback.

       end program JBTE0003.
